# Importing Important Libraries

In [1]:
import pandas as pd
import numpy as np

Read Data Files

In [2]:
df1=pd.read_excel('Branches.xlsx')
df1

   Branch_ID Branch_Name
0         BX        aws
1         DB      zillow
2         DL         eve
3         DN          ps
4         EA      aliyun
5         FR         get
6         GI      region
7         HU     alibaba
8         JG      europa
9         LD     magento
10        LJ          sp
11        MA       Maano
12        OM        Olix
13        VO        Ovie

In [3]:
df2=pd.read_excel('TransactionsSourceData1.xlsx')
df2

      Invoice Number       Date Product-ID Branch ID  Net Sales    Cost
0             659439 2013-01-01  QU-G83911        DN     616.22  295.79
1             659440 2013-01-02  VE-T83553        GI      56.40   26.51
2             659440 2013-01-02  CA-G84812        DB     178.75   96.53
3             659440 2013-01-02  DA-T81656        LJ     391.52  207.51
4             659441 2013-01-03  QU-G83911        GI      80.24   43.33
...              ...        ...        ...       ...        ...     ...
1420          660138 2013-12-31  VE-T83553        DN      22.56   11.05
1421          660138 2013-12-31  MT-C81287        MA     102.74   48.29
1422          660138 2013-12-31  CA-G84812       NaN     338.58  176.06
1423          660138 2013-12-31  VE-T83553       NaN      22.56   11.05
1424          660138 2013-12-31  MT-C81287       NaN     102.74   48.29

[1425 rows x 6 columns]

In [4]:
df2.describe()

       Invoice Number    Net Sales         Cost
count     1425.000000  1425.000000  1425.000000
mean    659792.387368   199.211396   101.762267
std        204.738097   176.773976    90.110446
min     659439.000000     1.220000     0.570000
25%     659618.000000    45.000000    23.130000
50%     659785.000000   152.880000    80.320000
75%     659975.000000   301.840000   154.460000
max     660138.000000   900.000000   486.000000

In [5]:
df2.describe(include='object')

       Product-ID Branch ID
count        1423      1422
unique         12        14
top     FU-T88744        MA
freq          230       119

In [6]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Branch_ID    14 non-null     object
 1   Branch_Name  14 non-null     object
dtypes: object(2)
memory usage: 356.0+ bytes

In [7]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1425 entries, 0 to 1424
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Invoice Number  1425 non-null   int64
 1   Date            1425 non-null   datetime64[ns]
 2   Product-ID      1423 non-null   object
 3   Branch ID       1422 non-null   object
 4   Net Sales       1425 non-null   float64
 5   Cost            1425 non-null   float64
dtypes: datetime64[ns](1), float64(2), int64(1), object(2)
memory usage: 66.9+ KB

In [8]:
## branches
df1.shape

(14, 2)

In [9]:
df1.value_counts

<bound method DataFrame.value_counts of    Branch_ID Branch_Name
0         BX        aws
1         DB      zillow
2         DL         eve
3         DN          ps
4         EA      aliyun
5         FR         get
6         GI      region
7         HU     alibaba
8         JG      europa
9         LD     magento
10        LJ          sp
11        MA       Maano
12        OM        Olix
13        VO        Ovie>

In [10]:
df1.value_counts().count()

14

In [11]:
df2.shape

(1425, 6)

In [12]:
df1.size

28

In [13]:
df2.size

8550

In [14]:
df1.isna().sum()

Branch_ID      0
Branch_Name    0
dtype: int64

In [15]:
df2.isna().sum()

Invoice Number    0
Date              0
Product-ID        2
Branch ID         3
Net Sales         0
Cost              0
dtype: int64

In [16]:
df1.duplicated().sum()

0

In [17]:
df2.duplicated().sum()

1

# Merge

In [18]:
# common column name must be the same 
#--> df1.merge(df2 ,on ='common column' , how='inner' , outer, full)

In [19]:
df2=df2.rename(columns={'Branch ID':'Branch_ID'})

In [20]:
df2

      Invoice Number       Date Product-ID Branch_ID  Net Sales    Cost
0             659439 2013-01-01  QU-G83911        DN     616.22  295.79
1             659440 2013-01-02  VE-T83553        GI      56.40   26.51
2             659440 2013-01-02  CA-G84812        DB     178.75   96.53
3             659440 2013-01-02  DA-T81656        LJ     391.52  207.51
4             659441 2013-01-03  QU-G83911        GI      80.24   43.33
...              ...        ...        ...       ...        ...     ...
1420          660138 2013-12-31  VE-T83553        DN      22.56   11.05
1421          660138 2013-12-31  MT-C81287        MA     102.74   48.29
1422          660138 2013-12-31  CA-G84812       NaN     338.58  176.06
1423          660138 2013-12-31  VE-T83553       NaN      22.56   11.05
1424          660138 2013-12-31  MT-C81287       NaN     102.74   48.29

[1425 rows x 6 columns]

In [21]:
merged=df1.merge(df2 ,on ='Branch_ID')
merged

,Branch_ID,Branch_Name,Invoice Number,Date,Product-ID,Net Sales,Cost
0,BX,aws,659442,2013-01-04,QU-G83911,396.00,209.88
1,BX,aws,659443,2013-01-05,BE-G88383,251.55,125.78
2,BX,aws,659446,2013-01-05,QU-G83911,288.00,135.36
3,BX,aws,659446,2013-01-05,QU-G83911,672.24,315.95
4,BX,aws,659450,2013-01-08,QU-G83911,481.44,255.16
...,...,...,...,...,...,...,...
1417,VO,Ovie,660094,2013-12-12,VE-T83553,173.42,84.98
1418,VO,Ovie,660111,2013-12-18,CA-G84812,343.75,185.63
1419,VO,Ovie,660114,2013-12-20,YA-C83103,85.19,44.30
1420,VO,Ovie,660123,2013-12-25,FU-T88744,30.50,16.47
1421,VO,Ovie,660137,2013-12-31,NaN,159.83,84.71

In [22]:
merged

,Branch_ID,Branch_Name,Invoice Number,Date,Product-ID,Net Sales,Cost
0,BX,aws,659442,2013-01-04,QU-G83911,396.00,209.88
1,BX,aws,659443,2013-01-05,BE-G88383,251.55,125.78
2,BX,aws,659446,2013-01-05,QU-G83911,288.00,135.36
3,BX,aws,659446,2013-01-05,QU-G83911,672.24,315.95
4,BX,aws,659450,2013-01-08,QU-G83911,481.44,255.16
...,...,...,...,...,...,...,...
1417,VO,Ovie,660094,2013-12-12,VE-T83553,173.42,84.98
1418,VO,Ovie,660111,2013-12-18,CA-G84812,343.75,185.63
1419,VO,Ovie,660114,2013-12-20,YA-C83103,85.19,44.30
1420,VO,Ovie,660123,2013-12-25,FU-T88744,30.50,16.47
1421,VO,Ovie,660137,2013-12-31,NaN,159.83,84.71

In [23]:
merged['Profit']=merged['Net Sales']-merged['Cost']

In [24]:
merged.columns

Index(['Branch_ID', 'Branch_Name', 'Invoice Number', 'Date', 'Product-ID',
       'Net Sales', 'Cost', 'Profit'],
      dtype='object')

In [25]:
merged['Branch_Name']=merged['Branch_Name'].str.upper()

# Business Querstions

In [27]:
merged.groupby(['Branch_Name'])['Profit'].sum()

Branch_Name
ALIBABA    12539.19
ALIYUN      8564.05
AWS        12241.66
EUROPA     10285.21
EVE         9195.71
GET         9589.53
MAANO      10104.11
MAGENTO    10569.41
OLIX       10040.07
OVIE        8745.83
PS          8595.78
REGION     10513.21
SP          9491.59
ZILLOW      8161.18
Name: Profit, dtype: float64

In [28]:
#products

In [29]:
merged['Product-ID'].value_counts()

FU-T88744    230
QU-G83911    210
YA-C83103    207
VE-T83553    139
CA-G84812    134
AS-C89526    132
BE-G88383     84
CR-C83971     69
DA-T81656     68
FA-T82068     59
MT-C81287     47
SU-G81548     41
Name: Product-ID, dtype: int64

In [30]:
#Total products
merged['Product-ID'].value_counts().count()

12

In [31]:
#Total sales by products
merged.groupby(['Product-ID'])['Net Sales'].sum()

Product-ID
AS-C89526    21279.36
BE-G88383    22863.18
CA-G84812    29111.17
CR-C83971    17371.14
DA-T81656    22785.71
FA-T82068    17826.62
FU-T88744     4618.04
MT-C81287     5403.57
QU-G83911    76736.56
SU-G81548    10504.49
VE-T83553    13852.22
YA-C83103    40774.47
Name: Net Sales, dtype: float64

In [32]:
merged.columns

Index(['Branch_ID', 'Branch_Name', 'Invoice Number', 'Date', 'Product-ID',
       'Net Sales', 'Cost', 'Profit'],
      dtype='object')

In [33]:
#Total orders by branch name
merged.groupby(['Branch_Name'])['Invoice Number'].count()

Branch_Name
ALIBABA    110
ALIYUN      97
AWS        107
EUROPA     105
EVE         97
GET        100
MAANO      119
MAGENTO    109
OLIX       106
OVIE       101
PS          90
REGION      98
SP         102
ZILLOW      81
Name: Invoice Number, dtype: int64

In [34]:
#top 5 products
merged['Product-ID'].value_counts().head(5)

FU-T88744    230
QU-G83911    210
YA-C83103    207
VE-T83553    139
CA-G84812    134
Name: Product-ID, dtype: int64

In [35]:
#bottom 5
merged['Product-ID'].value_counts().tail(5)

CR-C83971    69
DA-T81656    68
FA-T82068    59
MT-C81287    47
SU-G81548    41
Name: Product-ID, dtype: int64

In [36]:
#top branch by profit 
top=merged.groupby(['Branch_Name'])['Profit'].sum()
top

Branch_Name
ALIBABA    12539.19
ALIYUN      8564.05
AWS        12241.66
EUROPA     10285.21
EVE         9195.71
GET         9589.53
MAANO      10104.11
MAGENTO    10569.41
OLIX       10040.07
OVIE        8745.83
PS          8595.78
REGION     10513.21
SP          9491.59
ZILLOW      8161.18
Name: Profit, dtype: float64

In [37]:
top.head(1)

Branch_Name
ALIBABA    12539.19
Name: Profit, dtype: float64

In [38]:
#Total orders by branch and product 
p=merged.groupby(['Branch_Name','Product-ID'])['Invoice Number'].sum()
p

Branch_Name  Product-ID
ALIBABA      AS-C89526     4618455
             BE-G88383     5937965
             CA-G84812     9236716
             CR-C83971     1319603
             DA-T81656     3958885
                            ...
ZILLOW       MT-C81287      659851
             QU-G83911     9897696
             SU-G81548     3298581
             VE-T83553     3959081
             YA-C83103     8576945
Name: Invoice Number, Length: 167, dtype: int64

In [39]:
# Total invoices 
merged['Invoice Number'].value_counts().count()

700

In [40]:
# total , avg , max , min of (sales) 
merged['Net Sales'].sum()

283412.36

In [41]:
merged['Net Sales'].mean()

199.30545710267228

In [42]:
merged['Net Sales'].max()

900.0

In [43]:
merged['Net Sales'].min()

1.22